Revit 2026 API

# ElementPhaseStatusFilter(ElementId, ICollectionElementOnPhaseStatus, Boolean) Constructor

---

Initializes a new instance of the ElementPhaseStatusFilter class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementPhaseStatusFilter(
	ElementId phaseId,
	ICollection<ElementOnPhaseStatus> phaseStatuses,
	bool inverted
)
```
```vb
Public Sub New (
	phaseId As ElementId,
	phaseStatuses As ICollection(Of ElementOnPhaseStatus),
	inverted As Boolean
)
```
```cpp
public:
ElementPhaseStatusFilter(
	ElementId^ phaseId,
	ICollection<ElementOnPhaseStatus>^ phaseStatuses,
	bool inverted
)
```
```fsharp
new :
        phaseId : ElementId *
        phaseStatuses : ICollection<ElementOnPhaseStatus> *
        inverted : bool -> ElementPhaseStatusFilter
```

#### Parameters

phaseId ElementId

phaseStatuses ICollectionElementOnPhaseStatus

inverted Boolean

#### Reference

ElementPhaseStatusFilter Class

ElementPhaseStatusFilter Overload

Autodesk.Revit.DB Namespace